import random

a=("Иванов", "Сидоров", "Петров", "Пушкин", "Смирнов", "Барабанов", "Арбузов", "Колобков", "Громов", "Дубов")
b=("Шерементьев", "Словаков", "Дымов", "Врагов", "Кротов", "Лисичкин", "Иванов", "Флотов", "Ячнев", "Блок")

team = tuple(random.sample(a, 5) + random.sample(b, 5))

print ("Моя группа:", a)
print ("Другая группа:", b)
print ("Спортивная команда:", team)
print(len(team))
print(sorted(team))

k=0
if "Иванов" in team:
    k+=1
    print("Иванов встречается: ", k, "раз")
else:
    print("Иванов не встречается ни разу")